# services/constants.py
"""
一个用于存放所有硬编码常量、配置和数据映射的中央文件。
这有助于保持代码的整洁 (Don't Repeat Yourself)。
"""

# --- 户型相关常量 ---
ROOM_TYPE_COUNTS = {
    '1BD': 150, '1BP': 19, '2BD': 15, '3BR': 1,
    'STD': 22, 'STE': 360, 'STP': 12
}
ROOM_TYPE_AREAS = {
    '1BD': 73, '1BP': 88, '2BD': 108, '3BR': 134,
    'STD': 45, 'STE': 60, 'STP': 67
}
ROOM_TYPE_NAMES = {
    '1BD': "一房豪华式公寓", '1BP': "一房行政豪华式公寓",
    '2BD': "两房行政公寓", '3BR': "三房公寓",
    'STD': "豪华单间公寓", 'STE': "行政单间公寓",
    'STP': "豪华行政单间"
}

# --- 工单服务相关常量 ---
SERVICE_CODE_MAP = {
    'A01': '更换布草', 'A02': '家具保洁', 'A03': '地面保洁', 'A04': '家电保洁',
    'A05': '洁具保洁', 'A06': '客用品更换', 'A07': '杀虫', 'B1001': '电梯',
    'B101': '冰箱', 'B102': '微波炉', 'B103': '烘干机', 'B104': '电视',
    'B105': '洗衣机', 'B106': '空气净化器', 'B107': '抽湿机', 'B108': '油烟机',
    'B110': '电风扇', 'B114': '取暖机', 'B117': '投影仪', 'B119': '屏幕',
    'B120': '热水器', 'B121': '洗碗机', 'B122': '电磁炉', 'B123': '烤箱',
    'B124': '排气扇', 'B201': '烟雾报警器', 'B202': '手动报警器',
    'B203': '消防喷淋', 'B204': '消防应急灯', 'B301': '暖气片', 'B302': '通风管',
    'B303': '空调', 'B401': '毛巾架', 'B402': '龙头', 'B403': '室内门把手/门锁',
    'B404': '窗户', 'B405': '铰链', 'B501': '电源插座', 'B502': '开关',
    'B503': '灯具', 'B504': '电灯泡', 'B505': '灭蝇灯', 'B506': '拖线板',
    'B601': '家具', 'B602': '橱柜', 'B603': '天花板', 'B604': '地板',
    'B605': '墙', 'B606': '百叶窗', 'B607': '脚板', 'B701': '排水',
    'B702': '浴盆', 'B703': '镜子', 'B704': '瓷砖', 'B705': '水槽',
    'B706': '花洒', 'B707': '马桶', 'B708': '台盆', 'B801': '其他',
    'B901': '网络设备'
}
LOCATION_CODE_MAP = {
    '002': '卧室', '004': '厨房', '008': '卫生间', '009': '客厅',
    '001': '公寓外围', '003': '工区走道', '005': '后场区域', '006': '前场区域',
    '011': '电梯厅-后', '010': '电梯厅-前', '007': '停车场', '012': '消防楼梯',
}

# --- 客户信息查询常量 ---
IMPORTANT_FIELDS = [
    'id', 'profile_id', 'name', 'sex_like', 'birth', 'language',
    'mobile', 'email', 'nation', 'country', 'state', 'street',
    'id_code', 'id_no', 'hotel_id', 'profile_type', 'times_in',
    'create_user', 'create_datetime', 'modify_user', 'modify_datetime',
]

FIELD_NAME_MAPPING = {
    'id': '主键ID', 'profile_id': '客户档案ID', 'name': '姓名',
    'sex_like': '推断性别', 'birth': '出生日期', 'language': '语言代码',
    'mobile': '手机', 'email': '电子邮件', 'nation': '国籍代码',
    'country': '国家代码', 'state': '省份/州代码', 'street': '街道地址',
    'id_code': '证件类型代码', 'id_no': '证件号码', 'hotel_id': '酒店ID',
    'profile_type': '客户档案类型', 'times_in': '入住次数',
    'create_user': '创建用户', 'create_datetime': '创建时间',
    'modify_user': '修改用户', 'modify_datetime': '修改时间',
}